// 화살표 함수 : 함수표현식 형태, function키워드 대신 =>를 사용

// 함수(); // 4번 줄 없을 때는 '함수 is not defined' 에러
        // 밑에 함수를 화살표 함수로 선언 후에는 '함수 is not a function' 에러 -> 호이스팅 X
var 함수 = () => {
    console.log('서캠에서 메뉴선정을 맡은 이람다선생님!');
}
함수();


// 매개변수(파라미터)

// 함수2(); //에러
// let 함수2 = (파라미터) => {
//     console.log(`서캠에서 막내를 맡은 ${파라미터}선생님!`);
// }

let 함수2 = 파라미터 => {   // 매개변수가 1개이면 ()소괄호 생략 가능
    console.log(`서캠에서 막내를 맡은 ${파라미터}선생님!`);
}
함수2('김윤호');

const 함수3 = 파라미터 => `서캠에서 귀여움을 맡은 ${파라미터}선생님🐱`
console.log(함수3('최성우'));
